[
  {
    "title": "President Trump announces multiple new investments",
    "url": "https://www.youtube.com/watch?v=1r79f1aRDhs",
    "timestamp": "2025-09-23 19:14:55",
    "context": "very  unique, man.  That's   uh, I think I could say in   the world of  ships,   certainly.  But in the  world  pretty  much  a business.  Nobody's  done. What  he's   done. A very, uh, for those  of  you that  are into  that   world,  uh, you would say,   wow he's  a legend  but he is  a legend  and it's  an  honor  to  be  with you. very  great  honor.  Thank you very  much.  Thank you very  much. Uh,  welcoming from  tsmc, which  is  the biggest there is  at   a level that  uh, can't even   calculate.  frankly.  CC way   to  the White House.  for a  very  historic  announcement.  This is a tremendous  thing  for our country and hopefully  for his company.  we're also   pleased to  be  joined  by   Commerce  Secretary Howard   lutnick and White House.   Ai and  Si  the crypto.  Czar, David saxs  another  2 very  highly  respected  people. It's  great.  to   have  you guys  involved  in   David.  Thank you very  much   for coming  on. David is   sort  of  the king  of  of   intellect.  in that world.   we  have  some  good  people.  today.  Taiwan  semiconductor  is  announcing  that  they   will  be  investing.   at least. 100 billion dollars  in  New capital in the   United  States, over  the  next  short period  of  time.  To  build state-of-the-art   semiconductor,   manufacturing,  facilities.  I think mostly  it's   going to  be  in  Arizona,   which is  what  I understand.  which is  a great A great  state.  I like  it  because I  want. It. but I want  most   of  them  actually. but I did  we  wanted  And we  wanted   big the most  powerful  AI   chips in the world. will be  made  right here  in   America.  And it'll be  a big  percentage  of  the chips  made  by  his company.  But  uh, as  you know, they're  based mostly  in  Taiwan.  and,  they're Far and Away   the biggest,  there's nobody   even  close this. 100 billion  dollars in  new investment   will  go  into  building  5.   Cutting Edge  fabrication  facilities  in the  great  state.  that  we  just   discussed.  Arizona.  and  we'll create thousands  of   jobs. many  thousands of   jobs  and the high-paying  jobs  in  total today's  announcement  brings  Taiwan   semiconductor Investments to   about.  165 billion.  They've  started already.  among the  largest new foreign direct   investments in  the United   States. Apple,  as  you know,  made a big  announcement   last  week. of  500 billion  and we have some  others   that  have  announced.  We   have  many  that  want to  announce  But I don't have   time  to  do  all of  these  announcements.  I tell  you,   but for you,  I'm doing the  announcement. Thank you This   will  create  hundreds  of   billions  of  dollars in   economic  activity  and boost  America's dominance and  artificial  intelligence  and  Beyond  semiconductors  are  the backbone  of  the  21st century  economy and  really  without the  semiconduct  economy.  powering   everything  from  AI  to   automobiles,  to  Advanced   Manufacturing.  and We must  be  able  to  build the chips  and semiconductors  that   we need right here  and  American factories with  American  skill and American   labor.  And that's  exactly  what  we're doing.  As, you  know, Taiwan  pretty  much   has a monopoly  on that  market. and I think pretty   much  is  not a term  that's   even  appropriate.  They do  have  a monopoly  and this   is  a tremendous  move  by   the most  powerful  company  in the  world.  It's  a  matter of economic. Security.  It's  also  a matter  of   National  security  for us.  and for us. and at the same  time, uh, Mr. Way will  be   able  to  diversify and have   his,  uh, tremendous   presence  in  another place.   and to save very safe place.   And I want to thank Taiwan   semiconductor for doing the  announcement  and I'd like   to  ask.  Mr. Way to  say  a few words.  If  you might  and I'd also  like  to  ask  Howard  and David,  you can  say a couple  of  words,  but  maybe you should  go  first,   because right now he's  the  most  important man in the   room. I'm sorry.  Fellas,  please. thank you very  much.  Thank you.  Thank you.   very much.  Thank you.  I'm  uh, I'm a little bit nervous,  so  I have  to  pour  out my   piece of  paper.  uh,  Mr. President.  Secretary.   And David,  I didn't  know   that  your  title but uh,  Okay. Um, First,  I want  to   thank.  Uh, say thank you to   best of president.  to give  me. this  opportunity.  To   announce  our big project.   in the  US. Uh, tsmc. is  the  world's largest.   chip Manufacturing? funded   by  Dr? Morris Chen.  In   1987. is  now,  at  the  Forefront of  a semiconductor  technology. Supporting  AI   advancement.  And Industry   growth. in fact,  I would  like to,  uh, 1 back, uh, to   time  that  in  2020. we   have  2 s president Trump's  vision. and his support.  So   tsmc  start the Journey of   establishing  the advanced   ship the manufacturing. uh,  in  Arizona.  and now,  let  me, uh, uh, proudly say now,   the vision  become  reality.   In  Phoenix,  Arizona.  uh,  we  3,000 employees.  We  are  producing the most  advanced   chip. Made  on  us. So. uh,  with  the success of  our  first 5.  So, we  are now.   uh, very  happy to  announce.  We  are ing to  invest.  additional. 100 billion  US dollar.  in  addition  to   our current 65  billion US   Dollars investment  in   Arizona,  we  are going to   build 3,  more  new,  Fact.  be  after we  promise the 3  FS  already,  and another 2  very  Advanced  Packaging.   5 and most  important.  uh   R&D Center. also  in  Arizona  um, for this. all the  investment. 165 billion.  is   going to  create. thousand   of  the high  pay job as  a  president.  as  announced.   And we  are.  most   important.  actually  we  are  going to  produce many  AI   chips.  We're going to   produce.  many. many tips to   support the AI. So  progress.  and to  support the  smartphones of  progress.  and,  Again.  we  start uh, I  want to send  president Trump  again for his support.  In   addition, I also  want  to   thank my  customers in  the  US  such  as  Apple.  Nvidia.  AMD quack.  They  all support  tsmc is a Manufacturing.  in   the US. without their  support.  We  probably   cannot  make  it true.  so,  again,  I want to thank them.  Also. I I like  to  send  the  tsmc's. employee. without  their effort. we just cannot   make  it  today.  That's  all  I want  to  say,  And  thank you.  Thank you.  so,  I'm thrilled  to  be  here   today.  because uh, president  Trump has made  it  a  fundamental objective to   bring.  semiconductor chip   Manufacturing.  home  to   America.  Um, under the Biden  Administration. Uh, Tsmc   received  a 6 billion dollar   Grant.  and that  encouraged   them  to  build.  65 billion   dollars.  to  America gave   tsmc  10% of the money   build here. and now you're   seeing  the power of  Donald   Trump's presidency. because  tsmc, the greatest   manufacturer  of  chips in   the world.  is  coming  to   America with  a hundred  billion dollar  investment.  and of course that  is   backed  by  the fact  that   they  can come  here. because  they  can avoid paying   tariffs.  So  the idea  is   come  to  America.  Build  greatness in  America.  Build  4.  the American  customers,   the Apple Nvidia  that  whole  list. that  uh, chairman  way  gave  in order  to  bring.   production  to  America.  So   we're really, really   excited.  This  continues.   The most  incredible  path   you've  ever  seen. in  these  first weeks and months  of   the Trump Administration. of   incredible  manufacturing.   Coming  to  America.  the  keys  that  the president has  called  out are coming  here.  They're coming  here  in   huge  size. because they   want to be  in the  greatest   Market  in the  world and  they  want  to  avoid the  tariffs that  if  they're not  here, they'd  have  to   suffer  So  I want to  congratulate  uh, CC  way for  bringing  in  this   incredible. hundred billion  dollar  investment. but it's   on  the shoulders of  our  president,  Donald  Trump,   which is  why he's  coming.  So, thank you.  Thank you.   David,  thank you,  sir.  Uh   well  the products  that   tsmc  makes are literally uh   the most  important products   in the  world.  I mean, these  Advanced  chips uh, Power.   everything  they  power AI,  they  power your  phone,   they  power your  cars. and  uh, without them  the whole  monitoring  economy would  stop, but they're not made   in the  United  States. So   for tsmc  to move here  is  a  huge  huge  development and  we  owe that  to  president  Trump's leadership  on  the  economy.  and secretary  lutnick as well.  And CeCe.  Thank you for for coming   here. Thank you.  Yeah, thank  you, Dan. So, thank you  very much,  a big percentage   of  chips with  this   investment  will  be  made.  Now a big percentage  Uh,  worldwide,  We  had very   little  almost  none. We   used to have  a lot with   Intel.  but we  had very   little  and we'll be  at   close to  40% of  the market.  With  this  transaction and  a couple  of  others  that   we're doing That's  a  tremendous. leap. Uh, like  a  leap  that  nobody  would  have  really  said  was  possible. So  I just  want to  thank you all for being here   if  you want  a couple  of   questions.  Ideally ideally  on  this  subject.  Yes.   jobs. is  yeah, they they  you're probably talking about  2025  thousand  jobs  but  it'll get bigger  and bigger   with  time  knowing this   gentleman it'll get bigger   and bigger. there'll be no   stopping  him.  Brian,  Go   ahead.  Uh, in  addition  to   the job you talked  about  National  Security  and  that's  1 thing I think a lot  of  Americans are  people don't understand.   explain the National   Security  aspect  of  this   well, without the chips and  semiconductors  nothing runs   today,  you can't.  buy a car  without him.  You can't get a  radio or  television. nothing  you can't get anything. and  we  thought it was  very   important.  obviously  business  was,  but we   thought even  in  terms of   National  Security  to have  uh, this  large percentage   of  the chips semiconductors   and other things  that  they   make  the most  important.   product and not a product  that  you can really  copy.  It, takes years and years,   you know, on, on  the needle   of  a pin.  is  total genius.  I mean, they  can put things   I mean  something the size   of  the needle, the point of   a pin,   they put information that is   just  not even  believable.  So  if  if  if  you would if   you would see this  it's   just  really  something.   Yes,  bruh  aspect  to  that   Honda and also  coming  to   Indiana.  Because of  the  tariffs once  again.   additional  jobs  and  Manufacturing is  more   prominent.  well  Honda's  coming  and I told you  about  Apple that  they're going to   be  starting  to  build  massively here. 500 billion.   Uh, and we  have  many  other  companies,  it's  going to   be  announced but we  had  many  that  have  already  announced and uh, now it's   going to  be  great.  It's   it's  looking it's  looking  really  strong. Uh, I don't  think this  country has ever   seen  anything  like  we're  seeing  right now now,  the,   uh, tariffs as, you know,  it'll start a week earlier.  Then  the reciprocal, which  is  going to  be  on a   couple  of  weeks earlier.   reciprocal  starts   reciprocal  tariff, Start on   April 2nd.  and I wanted to  make  it  April 1st,  but I  didn't  want  to  do. I  didn't  want  to  go  April  Fool's  Day because that   cost  me  that  costs a lot  of  money.  But that  1 day,   but so  we're going April  2nd,  but very  importantly  tomorrow. tariffs,  25%.  on   Canada. and 25%.  on  Mexico.  and that'll start.  So,  they're going to  have  to   have  a tariff. So, what   they  have to do  is, build  their car plants, frankly,   and other things  in the   United  States. in which   case  they  have  no  tariffs  In other  words,  you build,   and this  is  exactly what   Mr  way is  doing.  by   building  here, doing they'll  build.  if  they  did them   in  Taiwan  to  send  them   here. they'll have  25% or   30% or  50% or  whatever  the  number  may be  someday.   it'll go  only  up. uh, but  by  doing it  here, he  has  no  tariffs. So he's  way  ahead of the  game. And uh, I  would just  say this  to   people  in  Canada, or   Mexico  if  they're going to   build a car plants, the  people  that  are doing them   are much  better  off.   building  here, because we   have  the market  where the  market  where they  sell   the most. and,  uh, so  I  think it's  going to  be   very  exciting, Very   exciting  for the automobile   companies.  Uh, very   exciting  for I can think of   any as  an  example.  Uh,  North Carolina. they  had the  grid, I used to go  there to   buy furniture for hotels. and  it's  been  wiped out.  That   business  all went  to   other.  countries.  and now,   it's  all going to  come   back  into  North Carolina,  the furniture furniture.   manufacturing business.  Please, in Ukraine  minerals,  build.  Now dead  or  can it   be  revived?  What  what?  Well, I'll  let you know,  We're making  a speech, you  probably  heard about it   tomorrow  night,  So  I'll   let you know  tomorrow  night  but no, I don't think so. I  think,  uh, it's  look  at   it's a  great deal  for us   because,  you know, Biden.   very, very  foolishly.   foolishly if  stupidly   frankly.  gave  300 billion  dollars and 350 billion more   accurately, uh  to  a  country.  to  fight.  and to   try and do  things  And  you know  what  happened, we   get nothing.  We're getting  that, just  gave  it  that   if  we  could have  rebuilt  our entire  US Navy with  350  billion,  think of  it. 350  billion.  We  could have   rebuilt our US Navy.  So  he   gave  it  away. as  fast  as   the money could be  gone. And  what  we're doing is  getting  that  all back. and a lot  more  than  that  and would  we  need? It's  very   important for this  business   that  we're talking about  here  with  chips and  semiconductors  and  everything  else. we  need.  rare  Earths. and the deal   we  have  is  we  have  the  finest  rarest  City. What   do you  need  to  see from   president? Zalinski.   Start these negotiations.  Well, I just  think he   should be more  appreciative   because this  country has  stuck with  them. through  thick and thin, we've given  them. much  more  than   Europe  and Europe  should   have  given more  than  us   because as  you know, that's   right there.  that's  the  Border. Uh  this  uh, This   country,  really  was like   the fence on  the border. It   was it  was very  important  to  Europe  and I'm not  knocking  Europe, I'm saying   that  just, there were  a lot  smarter than  Joe Biden  because Joe Biden,  didn't   have  a clue. He  just  gave   money hand  over  a fist  and  they  should  have  been   able  to  equalize  with  us.  In  other words,  if  we   gave  a dollar, they  should   have  given well  we  gave   350 billion.  They  probably   gave  a hundred but on top   of  it  all,  they  get their  money back  because they   doing it  in  the form of a  loan  And it's  a secured  loan. So, when  I saw that,  which I've  known about for  a little  while,  I said   it's  time  for us  to  be   smart.  at  the same  time.  it's  great for them  because  they get us.  In the   country,  taking  the rare   earth.  which is  going to   fuel  this  big engine  and  especially  the engine. that   we've in  a very  short time   created.  And we  get  something and we're in  the  we're there we  have  a  presence  there.  With  all  of  that  being said, I want   1 thing to  happen. I want   all of  those young people   to  stop  being killed   They're being killed  by  the  thousands,  every single   week. last  week. 2700  were   killed  2700. young In   this case,  just  about all  Young boys. uh, from   Ukraine.  and from  Russia.  and,  that's not  young  people  from  the United   States, but it's  on  a human  basis.  I want  to  see it,  stop. The money is  1 thing,   but the,  the death and  they're losing  thousands of   soldiers  a week. and that's   not including the people   that  get killed  every time.  A town  goes  down  or  a  missile goes  into  a town.  Uh, and we  and and I want   to  see it. Stop. Yes.  Are  you considering canceling  military  aid to  Ukraine and  can we  get a reaction? to   what  the current leader   said  that  your   Administration  is  bringing   in US world view in alignment  with  Moscow. So, this is  a deal  that  should  have   never happened. This  is  the  deal  that  would have  never  happened  and it  didn't   happen  for 4 years.  it   didn't  happen. It  was never  even  close to  happening.   Uh, if  I were  president  would not have  happened. and  October 7th would have   H would not have  happened   in. Israel. Uh, and  inflation.  Wouldn't  have   happened  and Afghanistan.   disastrous. the way they   went  through.  Not the fact   that  they  were  through but  the way they  were  would  have  never happened  and we   would have  had baram right  now instead of  China,   having  it  it  was 1 hour   away  from  where China makes  their nuclear weapons,  we   would have  kept  baram with   1 of the  biggest air bases  in the  world.  All of  these  things  happened  and it's  a  shame but it  is  what   it is.  And now we're here.  uh, I want  to  see it  end  fast. I don't want  to  see  this  go  on  for years and  years now,  president  zielinski supposedly. made  a  statement today in  AP, I'm  not a big fan of  AP  so   maybe it was  an  incorrect  statement but he  said  he   thinks  the wars  going to   go. on  for a long  time. Uh,  and he  better  not be  right  about that. That's  all I'm  saying. This project. I want   well. well, it's  a very   interesting point.  It's   a great question  actually   but this  would certainly,   uh, I can't say minimize   that  would be  a  catastrophic  event  obviously.  but it  will   at least  give  us  a  position  where we  have   in this very, very  important  business. We  would have  a  very  big part of it  in  the  United  States. So, we  have   a big impact  if  something  should  happen  with  Taiwan.  Are you looking at? Russian  sanctions if  there is   a peace deal. We're going to   make  deals with. uh   everybody.  to  get this  war  including Europe  and  European  nations.  And  they've acted very  well, You  know, they're good  people. I  know  most  of  them  are  friends of  mine. The heads  of  state,  the heads of  the  various countries,  prime  ministers,  from, uh, the  different.  I get 4 prime  minister. and 4 prime  Ministers and 5 presidents   called  me. Over  the last   uh, 2 days. And they  want to  work  it  out.  They  want   to  get it. Worked  out.  and  I think,  they're also,  you know, they're talking  money but the money is  less   important than  the deaths.  We're talking thousands of   young people. are weak  and  people  would say,  why do I   care  about Ukraine?  young  people? Why do  I care   about?  and not all young but  they're pretty  young.   You know, Ukraine is  running  a little  bit low.  And  they're getting older.   they're recruiting  older  people. It's  a very  very   sad thing that's  happening  over  there and we  want to  get it. finished. We  want   to  stop  the death.  On  the  terrorists. Is there any   room  left  for Canada  and  Mexico  to  make  a deal   before  midnight? And should   we  expect? those Chinese  tariffs,  the extra 10% to   take  no  room  left. or   Mexico, or  for Canada  know,  the tariffs.  uh, you know,  they're all set.  They  go   into  effect  tomorrow. The  poured into our country from.  From. Mexico, And as, you  know, also  from  China where  it  goes  to  Mexico  and  goes  to  Canada. and China  also  had an  additional   10. So  it's  10 plus 10  and  uh, and it  comes in  from   Canada  and it  comes in   from  Mexico  and uh, that's   a very  important thing to   say.  Yeah, please  go   ahead.  About that right now.  Uh, a lot of  things  are  happening right now.  as  we   speak.  I mean, literally,   as  we  speak,  I could give   you an  answer  and go  back   to  my  office, the beautiful  Oval  Office. I could go   back  into the  Oval  Office   and find  out that  the  answer  is  obsolete. It's   like  his business. it's   obsolete. You come  up  with   a new chip  and it's obsolete  about 2 minutes later,   right?  But that's  what's   good  about his business.  that's  why he's  the only  1  that's  successful  in it.   But what my colleagues   question  from  Russia  is   saying  that  your  foreign  policy  is  largely in  line   with  their vision. Should   that  be  concerning  to   Americans?  said? What   should  that  be  concerning   to  Americans Read the   statement that  Russia?  Russia  says  that  your   administration's  foreign  policy  is  quote largely in   line  with  their Vision.  Well, I tell you  what  I  think it  takes 2 to  tango  and you're  going to  have   to  make  a deal  with   Russia  and you're  going to   have  to  make  a deal  with   Ukraine.  You're  going to   have  to  have  the the uh   ascent   you're going to have to have   the consent for them  the  European  nations Because I  think that's  important And  from  us, I think everybody.   has to  get into a  room. so   to  speak.  And we  have to  make  a deal. and the deal   can be  made  very  fast, it   should  not be  that  hard  a  deal  to  make. It  could be   made. very  fast  now.   Maybe.  somebody  doesn't  want  to  make  a deal  and  if  somebody  doesn't want   to  make  a deal, I think  that  person  won't be   around  very  long  that   person. will  not be   listened  to  very  long. uh,  because I believe that   Russia  wants to  make   a deal. I believe certainly  the people  of  Ukraine want   to make a deal, they've  suffered  more  than  anybody  else. We  talked   about suffering,  they've  suffered  but if  you think  about it, Under.  President  Bush, they  got Georgia.   Right.  Russia  Got you.   Under President,  Obama.   They  got.  a nice  big.   submarine base. a nice big   chunk of  land. where they   have  their submarines,  you know  that, right?   Crimea. Under.  President  Trump,  they  got nothing and  under President Obama Biden,   They  tried to  get the whole  thing.  they  tried to  the  whole thing,  they  uh, big  Ukraine.  The whole thing If   I didn't  get in  here, they   would have  gotten  the whole  thing.  So, uh, I can only   say,  you can go  back  to   Bush. You can go  back  to   Obama and go  back  to   Biden.  They  took  a lot.   The only  1,  they didn't  get,  you know  what  I gave   them  I gave  them   anti-tank.  missiles. That's   what  I gave  them. I gave   them. uh, sanctions on   Russia. on  Russia. I gave   them  javelins, you know, the  javelins, you know, when   they  took  out all those  tanks,  you know, the tanks  were  heading to  Kiev  By   the.  hundreds. And they were  Unstoppable.  And I gave   them. javelin's.  so,  you know, I I I really  uh,  Putin is  the 1 that  will   tell  you.  This  is  not  been  so  good  for them. The  fact  is  that  I just  want   fairness, I want  fairness   but think of  it, I gave   Russia  nothing.  Except   grief.  I gave  him nothing.   I gave  him sanctions  and javelins, that's  what  I  gave  him.  Obama gave  him  sheets, and you heard that   statement before. It's  a  very  famous  Trump gave  him  javelins  and Obama gave   machetes. And then  they  say  how close I am  to  Russia.  Let me  tell you, we  have   to  make  a deal  because  there are a lot of  people   being killed, that  shouldn't  be  killed. but remember   Trump gave  them  nothing and  the other presidents  gave   them  a lot.  They  gave   them  everything.  The United States.  Is  that   something that  you would  consider  even  with   Argentina?  I consider   anything  and Argentina.  I  think he's  great.  by the   way,  I think he's  a great  leader. He's  doing a great  job.  He's  doing a fantastic  job.  Brought it  back  from   Oblivion. uh, yeah. Well   look  at  things. we're  looking at  the UK  with   things. It  doesn't have  to   be  tariffs but uh, tariffs  are easy. They're fast.  they're efficient.  and  they bring  fairness  for  instance, when  people  kill   their their dollar, their  equivalent  of  the dollar,  what  whether it's  the 1 or   the yen in  Japan or  the 1  in  China,  when  they  drop   them  down  that  gives us   that  puts  us  at  a very   unfair  disadvantage. So  all  I have  to  do  is  say  Howard, we're gonna have  to   raise the tariffs a little   bit because I've  called   president XI. I've  called   the leaders of  Japan.  to   say,  you can't continue  to   reduce  and break down  your   your  currency. You can't do   it  because it's  unfair  to   us. It's  very  hard  for us   to  make  tractors   caterpillar here. when  Japan  China and other places. are  killing their currency.  Meaning driving it down.  So,  all of  these things, add up   and the way you solve it   very  easily  is  with   tariffs.  Because when  they   do  that  instead of  having   to  make  phone calls every  day,  like  I used to do.  with  uh, certain leaders  president XI  a little  bit.   a lot of  phone calls.   talking about the fact that  That. they're lowering. their  1, they're  lowering  it   down. and that  makes it   very, very  hard  for us. So,  this  way I just  say,  look,  let them  do  that  and we   make  up  for it  with  the  tariffs, but  The sure. I  will, I have  a lot of   respect for her.  I have  a  lot of  respect for her.  To   go  against China.  Well, I  can't say it. Depends on   what  they do with  their  currency. It  depends on   what  they  do  In  terms of   a retaliation with  some   kind of an  economic   retaliation,  which I don't  think they're going to   retaliate to  much. Hey,   look. The United  States  has  been, taken advantage of  for  40 years. the United  States   has been  a laughingstock for  years and years,  That's  why  this  gentleman is  built in   Taiwan  instead of  building   here  it would have been   better  if  he  built here.  If we had a president that   knew what they  were  doing,   and we  had a lot of  them   very  bad on  trade.  Look,  I'm a huge  fan of  Ronald   Reagan  but he was  bad on   trade.  very  bad on  trade.   Uh, he  allowed a lot of   people, a lot of  business   to be taken so  I say that   with  due respect because I  I,  he  was so  great on   other things  but he was  bad  on  trade.  Uh, we  are  Setting records right now.   records,  like  nobody  has  ever  seen  before. When  you  have  companies like  this   coming  in, and almost  40%  of  their company in  1,   sine is going to  be   devoted.  To  what  he  does,  which is  1 of  the most   important.  important  businesses  in the  world.   That's  an  unbelievable   thing.  When  Apple now,  is   going to  start building  all  of  their plants  here, all  because of what we've done.  in  terms of  its not because  he  likes me  or  they  like   me, they  don't probably   like  me  at all, I don't  know. I think he  likes me   a little  bit at least.  You know  what? It's  it's   It's  the incentive.  we   created.  or  the negative   incentive.  I mean  it's   it's  going to  be  very   costly  for people. to  take   advantage of  this  country.   They  advantage come  in  and  steal our money and steal our  jobs  and take  our factories  and take  our businesses. and  expect  not to  be  punished.  and they're being punished   by  tariffs.  It's  a very   powerful  weapon  that   politicians haven't used   because they  were  either   dishonest.  stupid. Or  paid   off in  some  other form. and  now we're using them.  You said  have you spoken  with  President XI  about  this? This  I don't want to  tell you  that. Thank you  very  much. everybody.   Thank you,  thank you very   much. ",
    "tokens": 6030
  },
  {
    "title": "Beast Games | Episode 1 (Full Episode)",
    "url": "https://www.youtube.com/watch?v=C9Qfcjf7L-I",
    "timestamp": "2025-11-24 19:26:29",
    "context": "I am standing on $5,000,000 of real money. The largest grand prize\nin entertainment history, and competing for this $5,000,000\nare these 1000 contestants! -[cheers]\n-Come on in! [MrBeast]\nWhat you are witnessing is real. A record breaking number\nof a thousand players is currently stampeding this arena. But only one\nof these thousand people you are seeing will have what it takes\nto beat everyone around them and take home this generational wealth\nof $5,000,000 dollars. -Welcome to Beast Games!\n-[cheering] [woman] I grew up homeless, and now,\nI want to help other homeless kids. And that $5,000,000 would mean everything\nto help me get there. [man] If I win $5,000,000,\nI could use that to make passive income for the rest of my life. It would provide me the opportunity\nto retire my dad. The difference that money can make\nand how it can support community. Completely getting my whole family\nout of the poverty pipeline. There's a lot of clowns\nthat want to donate the money. I'm buying jet skis and gold chains. I will die for this.\nI will die for $5,000,000. [MrBeast] This is gonna be crazy.\nEveryone’s so excited. Good luck, man! This show is bigger\nthan anything you could ever imagine. We’ve got the most players,\nmillions of dollars of cash prizes, on top of the $5,000,000. We're giving away a Lamborghini\nand a multi-million dollar island. We even built an entire city. I'm MrBeast, these are my five friends, and what what you're about\nto see will blow your mind! Before the games begin,\nI have an offer for all of you. Most shows have a grand prize\nof $1,000,000. But on our show, we're going\nto give away $1,000,000 before we even play the first game. -[cheering]\n-Bring out $1,000,000! [dramatic music playing] [register dings] It's going to take a second.\n$1,000,000 is a lot of money. There's currently $1,000,000 in cash\nsitting in front of me. Throw ten minutes on the clock. You will have this ten minutes\nto make a decision. Stay in the game, or press the button\non your tablet and eliminate yourself. -[groans]\n-Those of you that eliminate yourselves will evenly split this $1,000,000\nI'm standing behind. So if only one of you eliminates yourself,\nyou'll become a millionaire. But if 50 of you eliminate yourselves,\nyou'll each get $20,000. So be honest, do you really think that you are\nthat one in 1000 player, the rightful champion winner\nof that $5,000,000? Or do you want to take the easy way out and walk away with money\nwhile you still can? Start the timer. [overlapping chatter] What will my family think?\nIf I say “no” to so much money? Take the deal. Take the deal. Yeah. I mean… It’s a lot of money… I will not leave this podium. I will not go home\nuntil that $5,000,000 is mine. -[chatter continues]\n-[boom] [MrBeast] Oh, we got one! [woman] Oh, my God! He did it! We got our first taker! Steve! As of right now, you're a millionaire. -But, oh! Someone else hit it!\n-[boom] Alright, now you’re only\na five-hundred thousandaire. -[beeps]\n-[booms continue] [man] That’s crazy though, bro, because\nimagine you're walking into a casino, you would never get that\nin a million years… [MrBeast] We are halfway through the time! Right now, if you press the button, -that's $250,000.\n-Heck, no. You're not gonna leave for $200,000? -No, I’m not--\n-$200,000? I’m not leaving. It’s just not worth it now.\nI mean, I-- I'm not taking the bribe. No chance.\nI'm here for the long haul till the end. -[yells]\n-Do you think I'm gonna take the deal? -No.\n-No way, Jimmy. No way. This dude's crazy. You're pressing it?\nYou're pressing it? Why not? It's getting a lot of people out\nright away, and that's less people\nwe have to compete against. -This is too intense, man!\n-We're staying! -Are you sure?\n-Yes! -[man] I don't know!\n-Think about it! There’s two minutes left! Oh, there goes another one! I ain't taking nothin’! [MrBeast] Bro, 90 grand’s a lot! That's cute compared\nto the $5,000,000 that's over here. Under one minute remains. [dramatic music continues] -Don't you dare.\n-[laughs] [laughing] Get out of here! [intensifying noises] -[clicks]\n-[booms] I should not have done that.\nI should not have done that. -Ten seconds!\n-You should press it now! -[MrBeast] Hey, y’all are crazy!\n-[yellling] Ah, come on, buddy!\nHit it! Hit the button! -No way!\n-[cheers] Are you serious? No way. [MrBeast] In the end,\nthe total amount of button presses was 52 people which means… Congratulations! You each\njust won a little under $20,000! -[cheering]\n-All 52 of you are now eliminated. I have a feeling\na lot of these contestants still in are gonna regret not taking that money, because this next game might be\nthe most cutthroat thing I've ever done. Should’ve took the money. Would this money change my life?\nAbsolutely. Do I want to see a pirate ship?\nDo I want to live in a city? So much more. ♪ I'm ready to go to the city\nI’m ready to go to the city ♪ ♪ I'm ready to go to the city ♪ I do not belong here.\nI don't know how I made it here. I have no strategy. [laughs] I'm done. [MrBeast]\nTo the 948 of you that rejected my offer, there is no turning back!\nThe Beast Games has now begun. [cheering] [dramatic music intensifies] And for the first game,\nyou will all be competing as teams. This row is a team.\nThis row is a team. This row is a team. You get the point. Each massive row\nof 80 players will be working together. -[cheers]\n-Yeah, but I wouldn't cheer quite yet, and that's because in order\nfor your team to move on, someone must sacrifice themselves. -Oh!\n-[MrBeast] Meaning that they will have to, at their own will,\nwalk away from $5,000,000, just so some of you\ncan continue competing in these games. Really thinking right now,\nI probably should have taken that $20K. So if you didn't take the money\nto go home, why would you\nsacrifice yourself for the team? I feel like I have to sacrifice myself. I just want people to know\nI really do care about them. And I wish more games\nwere like that. So… [overlapping chatter] I'm not going. I know you're not going.\nI know he's not going. -Who gon’ bite the bullets?\n-[man] I'm not touching it, please! Someone for the greater good\nof the whole team has to leave. -What's it look like down that way?\n-It won't be me. Nobody? Holy… [MrBeast]\nOh, yeah, and guys, one more thing. This game has already started, and it will not end until\nthe last three rows to eliminate someone will all be eliminated together. Only nine of the 12 rows\nwill be moving on. Come on! Click it! Click it! Click it! -[yells]\n-Come on! Oh! Whoa! That was quick. -Let's go! Safe! [laughs]\n-Congrats! Wait, come on. Please! Please! Please! -What's holding you back?\n-Somebody else might do it. Somebody! Over there, just somebody,\npush the button! [yells] What do we do? What do we do?\nCome on! -[cheering]\n-[man] Let's go! Don’t forget me! [cheers and yells continue] Yeah! Let’s go! -[shrieks]\n-Let's go! Let's go! Come on, guys, or we’re all gonna go!\nPress it! Press it! [buzzes] -Two!\n-I’m not going! -Darn it! Press it!\n-Please, press it! Please! Please! Please! Someone press it! Press the button!\nPress the button! [piano music playing] [yelling] -Please!\n-[man] Oh. One more, one more left. Press the button! Press the button!\nPress the f****** button! -[cheers and yells continue]\n-[music continues] [sounds fade out] -[yells and cheers]\n-I did it. [dramatic music intensifies] -[wails]\n-[man] Yeah! You're welcome. Win! Win! For your family… Please…\nWin for your family… I'll play for you, okay?\nI got this. Okay, I got it. I got it. Yeah! Yeah, baby!\nWe made it! We made it! Our whole row was just eliminated. My wife is still in there,\nand it only takes one person to win that $5,000,000, not two. Good luck, babe. All the kids and I\nwill be rooting for you at home. I'm trying not to cry. [laughs] -[man] Yeah! Yeah!\n-[cheering] -I love you!\n-I love you! In a very platonic way, I love you. -You took one for your team.\n-I did. All of these people deserve\na chance to win. Whoa. How are you feeling? Um, I’m sad. Everyone in your row, give her a round\nof applause for sacrificing herself. [applause and cheers] [clicks and beeps] [screaming] -[yells]\n-[woman] Oh, my God! -[yells]\n-Oh! Oh, my God! [yelling continues] [cries and yells] Now, a lot of you are probably wondering, is it even possible to drop 80 people\nat the same time? And the answer is yes. Drop the row. -[yells]\n-[mechanical clicks] [shocked crowd noises] [laughing] Whoa! That is crazy! Oh, my God. Oh… This row also couldn't find someone\nto sacrifice themselves. So… -[clicks]\n-Oh! There they go. [mechanical clicks] I think we mix it up for this final row. Hey, whoever's in the back,\njust start hitting random buttons. All right? [laughs] This is terrifying. [yelling] -Hey!\n-[man] No! No! No! No! -Okay. Well, all right.\n-Oh, my gosh. That was diabolical. Wait, there’s just one left. Any last words? I am not weak!\nThat's why I got number-- [yelling] All right, and with that,\nthe challenge is officially over. They should’ve got someone else. [cheers] I'm excited for another challenge,\nbut also nervous. So it's going to be tough. It's going to be stressful,\nbut it's going to be over soon. And we're going\nto make it to the city, baby. Let's go. [MrBeast]\nThe city she's talking about is no joke. This massive building you're seeing here\nis only the beginning. -Welcome to Beast City!\n-[cheers] [MrBeast]\nAt the end of this episode, contestants who progress\nwill move into their very own city. On top of that, later this season, they'll be fighting for their spot\non helicopters to a multimillion-dollar private island,\nwhich one of them will be winning. They'll also be firing cannons\non a real pirate ship. There's monster trucks. They'll run for their lives\nfrom real Navy Seals. And they will have to decide if\na train eliminates their closest friends. And of course,\nthey will have opportunities to win millions of dollars\non top of the grand prize. However, not all of them are confident. I guess the sad reality\nis not everybody can win. I think the odds are stacked against me.\nI've seen my competition. The reality of it is\nthat people are going to have to go, and I understand\nthat at any moment it can be me. The fact that it hasn't been me, really,\nhas a lot to do with luck. But that's the name of the game,\nand that's why we're here, to get down to one sole contestant\nwho's going to take home the $5,000,000. -I have a four-month-old son.\n-My dad, he's a military vet. I left my wife and my three-year-old son. But I want to fight for his future. Nothing I won’t do. No place I won’t go. I will do anything it takes\nto win that money. I've made amazing friends. Watching them get eliminated,\nit's brutal and short. Each round, we all get closer to winning. But moving on means saying goodbye\nto some really good people. -[dramatic music playing]\n-[lights click off] [clicking sound] [echoing] Are you guys ready\nfor the next challenge? [whispering] Alright, I'm gathering these games\nmight be a little stressful for you. So for this next game, let's introduce\nsomething a little more familiar. You'll notice, attached to each\nof your towers, are some colored boxes. Inside these boxes are blocks.\nYour goal is to stack all of your blocks on top of the red starting block\nwithin ten minutes. I don't care how you do it, as long as every block\nis stacked before the timer hits zero. At the end of the ten minute timer, if any of your blocks are not stacked\non top of that red block, or your tower falls over,\nyou'll be eliminated. I will only be eliminating\nthe first 100 towers that fall over. I'm shaking. I got to…\nYou shaking, bro? You are free to begin once\nthe timer starts. And… go! We're going\nuntil 100 of you are eliminated. The key here is to go slow. [MrBeast] So far in these games,\nthis exact room was deafeningly loud. -[yelling]\n-But somehow, even with over 700 players remaining, in this moment,\nit was nearly dead silent. [rumbling bass fades out] [clock ticking] [breathing heavily] Oh, my God. [crying]\nOh, my God. It's okay, it's okay. -[ticking continues]\n-[music intensifies] [blocks clanking] -[creaking]\n-[crashes] [gasps] -[crying] Oh, no!\n-[mechanical clicks] -[intense music playing]\n-[crying] I hate my life! -[ticking continues]\n-[music intensifies] No! [booms] Oh, no! Are you okay? Oh, no.\nYou still had more time. -Oh, my God.\n-[woman] Make as many squares as possible, so it's flat, flat, flat,\nso it's less height. How does mine look?\nDo you see any weaknesses? -Solid.\n-[man] Very solid. Top left. Yeah. You want to go over there\n'cause it's leaning a little bit. -To the left?\n-No, no, no. You want to go over here,\nyou want to counterweight it. Yeah. [music continues] Mine's done. But I can do… -[crumbling]\n-No, no, no. No! [buzzes] I decided to go as strong, as wide… Do you mind if I poke it? I would mind if you poked it.\nI do not want you to poke it. Okay. I won't poke it then. -[Nolan] They’re laser focused.\n-I know, I can finally hear you. -[laughs]\n-Oh! Oh! [buzzes] [crying] I'm gonna let you handle this one. -[booms]\n-Why do I gotta handle it? You got it, babe. Come on. Trust yourself. I don't even know.\nI don't even know if I still… [intense music playing] [crumbles] -Can you hand me that?\n-I can't, I'm sorry. I can't. I’m sorry. [booms] Oh. -[intense music continues]\n-[booms continue] [crumbles] -Oh.\n-[woman yells] [booming continues] Alright, I think this might\nbe the set up for me. No, brother! [rising chatter] It's tilting over this way. -No, no, hold it! Hold it! [yelling]\n-[crumbling continues] [man] Put it more towards the right side. -This side?\n-Center it out. Yeah. -This…\n-Right there. And hold it first. [music intensifies] [alarm blares] Attention, contestants! Do not move! I repeat, do not move! If less than 100 towers have fallen,\nwe will continue until 100 towers do fall. And so, while we're counting\nhow many towers have fallen, if I were you,\nI would stand very, very still. [dramatic music playing] [clock ticking] I'm really hoping\nthat there were 100 other towers that fell over before mine. I'm scared to move. [indistinct chatter] -I just…\n-[crumbles] [MrBeast]\nHere's a little behind the scenes. This is our control room\nwith all the guards. And they're not going to stop until\nthey've timestamped every tower fallen, using our world record holding\n1,107-camera system to find out which 100 towers fell first\nand who is going home. I think you're totally good.\nYou're definitely, like, good. [sniffles] Don't say that to me. [laughs] [digital noise intensifies] [dramatic music continues] [MrBeast] Alright, everybody,\ncan I have your attention? We needed 100 eliminations\nto move on from this challenge. And after reviewing footage\nfrom over a thousand cameras in this room, I have a verdict. Over 100 towers have fallen, which means if your tower is currently\nknocked over, you might still be in. There's so much tension.\nEven me, my legs are shaking. [MrBeast] On the count of three, I am going\nto reveal the eliminated players. -Are you ready to see who's eliminated?\n-[cheers] Three. Two. One. Go! -[clicks]\n-[yells] No! -[cheering]\n-[indistinct yells] -You're good! You're good! You're good!\n-[screams] [MrBeast] If your tower is white, you move\non to compete for this money. Let's go. [MrBeast] If it's red,\nwe’re gonna have to drop you. -[cheers]\n-[woman] That was awesome. [cheering and yelling continue] [cries] My heart was in my stomach. [MrBeast] There's a lot of people\nwho thought they were out who are still in. It looks like some people who are out,\nand didn’t realize they were. That's God. That’s God, I told y'all. We made it to the next round.\nLet's get after it. I'm just crying a little bit. I'm in. Noah's gone though, so that's harder. That's harder. But I'm in. Will you join me in saluting the people\nwho are about to be dropped? Everyone salute! [military trumpet playing] Guys, don't worry. The first few minutes of the fall are\nscary, but after that, it's totally fine. Drop 'em. -[military music intensifies]\n-[mechanical clicks] [yells] Whoever remains after this next challenge\nwill officially move into our city. [cheers] -Yeah!\n-Let’s get to the city, all right? [MrBeast]\nAll of you have made it very far. Let's get it, baby. [MrBeast]\nIt would be a shame to go out here. The only problem is the city has 500 beds,\nand there's over 600 of you. No. We need to get rid of over 100 people, so we're gonna play a little game. For this game,\nyou will again be competing in a team. But this time,\nit's the row to your left and right, which means they will vary in number. What do you think I'm going\nto be having you guys do? -[all] Bribes!\n-It's going to be a bribe. -A bribe.\n-[MrBeast] That is correct. This game is the final hurdle between\nyou and moving on in this competition. I will be offering bribes, -and whichever person accepts it,\n-[beeps] -will eliminate themselves and their rows.\n-[buzzes] The bribes will keep going up, and we will keep eliminating rows\nuntil we have 500 people. [dramatic music playing] All you have to do is take your hand,\npush that button, and you will instantly be brought\nbriefcases full of money. Almost immediately,\nthe room erupted in chaos, and people started to introduce\none another by their name. -My name’s Jonathan!\n-Alejandro! That's my name. [MrBeast] And not their number,\nbecause in this final game, the only way to move on\nis by working together. [music intensifies] [man] Come on! Yo! It’s this way. That's crazy. My name's Lori! We got this, we got this, we got this. I swear on everything.\nI will not take a bribe. 400! No, we're not doing it. Nothing, nothing, nothing, we are not. -Let's go. [laughs]\n-We got it. We got a good team right here.\nWe definitely going to the city, baby. We ain't doing this for nothing, baby.\nCome on, let's go. You can barely communicate\nwith 'em. How can you trust 'em? You can't.\nYou can say… you can't bro. -I haven't said anything to him.\n-Alright, I gotta know. It's kind of hard to. Is there a number? Yeah, but don't tell them. [Nolan] This could be one of the biggest\ndecisions of your life. He's like a devil on the shoulder, bro. [dramatic music continues] [MrBeast]\nAre you ready for the first bribe? -[cheers]\n-Guard, bring it on out. I've got a briefcase here\nwith $10,000 in it. [crowd booing] Ooh. Yeah, I think I'm gonna have\nto go for that one. I had a feeling not many of you\nwould go for that ten grand. But the good news is,\nwe have a lot of money. Bring out the next briefcase. -[shocked gasps]\n-Let's go! Now, I have $20,000 up here. No. [crowd boos] Hey-yo, Jordan! Just letting you know,\nyou scaring people, bro. Who, me? Yeah. I have no idea what they're saying,\nbut I'm chillin'. What dollar amount would it take\nto screw your row over? None.\nThat dollar amount right over there. -We're going until people leave, so…\n-Well, we ain't leaving. -[MrBeast] Hey, wait. What?\n-[man] Somebody took the 20K. [woman] Dude. Dang, bro, that's crazy.\nI felt so secure with the line. Yeah. We're done. Alright, what was the rationale? It's Beast Games,\nlike we're not here to make friends. 400! We're not doing it. Nothing. The fact is, I'm here for myself\nand my family, and I just– -Hey, gotta respect it.\n-I did it. I did it, bro. It's just not fair. I mean, it is, but it isn't.\nLike, I just didn't do anything. [MrBeast]\nThere was eight players in that row, which means there are now\n597 players remaining. AKA, 97 more people need to be eliminated. -[MrBeast] So who wants $20,000?\n-Nobody's going for it. [MrBeast] No? Well, all right.\nHow about $50,000 dollars? 50 grand is a lot of money. Who do you think is the weakest\nlink in your entire row? Between us, 674. When it was first announced\nthere was going to be this competition, we all looked at each other,\nwe were like, \"No way.\" And he was, I think, the one that was\njust kind of like, \"Okay, yeah, no.\" -Everyone trusts each other here, right?\n-Yeah! Alright. It's a $5,000,000 trust. He's thinking. I'm nervous about that. [musical sting] [Karl] Oh! Who did it? -[Tareq] Oh, my God, he pressed it.\n-[man] Jordan? -674, the guy that you were worried about?\n-The guy that I was worried about. Oh, boy. They're walking in front\nof the people you eliminated. Let's see if anyone else wants 50 grand. -Right here, dawg.\n-Dude! What the f***, Walter? I feel bad for those guys, but… [MrBeast] If you just don't turn around,\nthey don't exist. Yeah, that's kind of the mindset\nthat I’m going with. Don't take 50K. That's so stupid. I don't even want to look at him.\nI don't forgive him. [MrBeast] There's still 583 people here. Remember, we're going\nuntil we’re under 500 people. [buzzes] -Oh, somebody else pressed.\n-[MrBeast] What made you press it? I'm not gonna lie, I didn't trust my teammates. Really? You thought\nyour team was about to do it? I thought she was gonna to do it. Oh, my gosh. -Are you serious?\n-Alright, someone else hit it. -We got another 50 grand taker.\n-You just broke my heart, man. Like you said, it was either you or me. I trust my team. I think we got it.\nI think we're going to the city. We good. This ain't changing nothing.\nYeah. We good. Yeah, I'm not even gonna look at it. [MrBeast] Have you ever had an opportunity\nin your entire life to raise your finger, tap a button, and instantly give yourself $50,000 in cash? -[buzzes]\n-[groans] -[laughs]\n-No way, where? -[buzzes]\n-Oh, my gosh. -[MrBeast] Looks like someone hit it.\n-I’m sorry, babe. In this challenge,\nI've already given away 320 grand. but I still need to eliminate\n55 more players. Luckily, on this show,\nI have unlimited money to give away. Wow. This row is dedicated.\nTheir arms are in their shirts. I ain't going nowhere. Let's take it up a notch.\nMy new offer is 80,000 dollars. -[buzzes]\n-Oh! We're getting close to 500. -Anyone else want 80 grand?\n-I might have to go first. Oh! Another one! -This is getting crazy.\n-[buzzes] No! No! -[buzzes]\n-Take the money! It's the right thing to do for you. [MrBeast] You guys are crazy. -It's a ridiculous amount of money.\n-[buzzes] We got another press.\nWe got another press. -Did you press it?\n-Yeah. I took it. For my family,\nI gotta do that one. Dude! We all have families here, man. [MrBeast] There are 514 of you left.\n14 more eliminations to go. To get us over the hump,\nbring out two more briefcases. This will be my final offer,\n$100,000 dollars to anyone that self eliminates\nuntil we have 500 players remaining. [intense music playing] -[buzzes]\n-Oh! Somebody pressed it!\nSomebody pressed it! -Oh, my gosh!\n-Let’s go. [yells and cheers] -Alright. There's 508 of you.\n-My God! I still need eight more to go. $100,000 on the line. This could be the last button press. Oh, my God. -There’ll be bigger prizes later.\n-I won't even look at it. -Wow.\n-What is going on? Woo! Yeah! Yeah! Alright. 173 hit it.\nLet's see if there's eight people there. One. There's two. Three. Four. Five. Six. Seven. Oh. Um, small problem. There's only seven people in this row,\nwhich means the number is 501. -[groans]\n-No way. And I only have 500 beds in the city. Oh, we're so close. Yeah. Don't hit it. There's a Lamborghini,\na boat, in the city. You guys can have it.\nI just want the Tesla, okay. -We're going to the city!\n-City! -Take the money!\n-The city! -[MrBeast] So far in this game…\n-Hands in pockets, Gary. …people from all over the room\nwere boasting about trust. -We can trust each other, right?\n-Facts. City! City! City! City! -[claps]\n-[buzzes] [groans] [MrBeast] But sometimes, the people who you think\nyou can trust the most -are actually…\n-Oh, my God. …the people you can trust the least. -[cheers]\n-I took it. [piano music playing] It's 100! -Oh, my God. I’m so mad.\n-I'm sorry! -[MrBeast] And there we go.\n-I believed! [piano music continues] -[MrBeast] That is the end.\n-Yeah! [MrBeast] If your tower is white, you are\nofficially moving on to episode two. -[cheers]\n-We’re going to the city! Oh my God! -It's official. Let's go.\n-[MrBeast] Congratulations. We’re going to the city. -We’re going to the city!\n-We’re going, baby! Yeah! -And the final taker, $100,000.\n-Let's go, baby. And with that, we are now\nunder 500 contestants. It's okay. I forgive him. [MrBeast]\nWe've already given away over $2,000,000, breaking the world record\nfor the most amount of money given away in the first episode\nof a show ever. And this is just episode one. And at the end,\nsomeone is winning $5,000,000, the largest grand prize\nin any show in history. -You still got a chance!\n-Yeah! Yeah. [MrBeast]\nAnd to the 493 of you still competing, say your goodbyes to your fallen comrades. It's time for you\nto move into your brand new home. [emotional music playing] And to the rest of you,\nsay goodbye to $5,000,000. [electricity powers down] [clicking sounds] [intense music playing] [man] This is the most insane thing\nyou've ever seen in your lives. [MrBeast] 500 people is so many people. All right, guards, open the gate. Welcome to the city I built for you. Welcome to Beast City. I've spent over $15,000,000\nliterally building a city from scratch. And now, it's the city\nyou'll call home for the next month. They literally look like ants. Before I reveal the final twist\nof this episode, let me remind you\nwhat you have to look forward to. I just want to say,\nyou should all be proud of yourselves for making it this far. We started with a thousand contestants.\nYou have made it to the top 500! And we're just getting started. In coming episodes,\nyou will see the most insane, -psychological…\n-Catch it! -Get it. Get it. Get it.\n-[cries] [MrBeast] …emotional, and expensive\ngames in the history of entertainment, where people will compete\nfor their very own private island, if they can escape the Navy Seals\nhunting them down. [dramatic music playing] Go, go! [MrBeast]\nYou’ll watch players make the choice between a train eliminating their friends -and unfathomably large amounts of money…\n-$1,000,000! …and winning a brand new Lamborghini.\nAnd so, so much more. Good luck. Which one of these 493 players\nwill make entertainment history? As their lives will change,\nbut so will their bank accounts. And one of them\nwill become the champion winner of the largest real cash grand prize\nin the history of entertainment. Are you ready? [cheers] Throw up the 24 hour timer. When this timer hits zero, a game will begin\nwhere half of you will be eliminated. This show will take place\nover the next month. So if I were you,\nI'd get comfortable in this city. You're gonna need it. [clock ticking] Thanks for watching episode one \nof Beast Games!  I don't know how I convinced \nAmazon to do this but episodes two and three are free on\nthis channel as well. Enjoy the first three episodes here, and go watch the remaining seven episodes\nof Beast Games, only on Prime Video. ",
    "tokens": 6223
  },
  {
    "title": "Beast Games | Episode 1 (Full Episode)",
    "url": "https://www.youtube.com/watch?v=C9Qfcjf7L-I",
    "timestamp": "2025-11-24 19:28:44",
    "context": "I am standing on $5,000,000 of real money. The largest grand prize\nin entertainment history, and competing for this $5,000,000\nare these 1000 contestants! -[cheers]\n-Come on in! [MrBeast]\nWhat you are witnessing is real. A record breaking number\nof a thousand players is currently stampeding this arena. But only one\nof these thousand people you are seeing will have what it takes\nto beat everyone around them and take home this generational wealth\nof $5,000,000 dollars. -Welcome to Beast Games!\n-[cheering] [woman] I grew up homeless, and now,\nI want to help other homeless kids. And that $5,000,000 would mean everything\nto help me get there. [man] If I win $5,000,000,\nI could use that to make passive income for the rest of my life. It would provide me the opportunity\nto retire my dad. The difference that money can make\nand how it can support community. Completely getting my whole family\nout of the poverty pipeline. There's a lot of clowns\nthat want to donate the money. I'm buying jet skis and gold chains. I will die for this.\nI will die for $5,000,000. [MrBeast] This is gonna be crazy.\nEveryone’s so excited. Good luck, man! This show is bigger\nthan anything you could ever imagine. We’ve got the most players,\nmillions of dollars of cash prizes, on top of the $5,000,000. We're giving away a Lamborghini\nand a multi-million dollar island. We even built an entire city. I'm MrBeast, these are my five friends, and what what you're about\nto see will blow your mind! Before the games begin,\nI have an offer for all of you. Most shows have a grand prize\nof $1,000,000. But on our show, we're going\nto give away $1,000,000 before we even play the first game. -[cheering]\n-Bring out $1,000,000! [dramatic music playing] [register dings] It's going to take a second.\n$1,000,000 is a lot of money. There's currently $1,000,000 in cash\nsitting in front of me. Throw ten minutes on the clock. You will have this ten minutes\nto make a decision. Stay in the game, or press the button\non your tablet and eliminate yourself. -[groans]\n-Those of you that eliminate yourselves will evenly split this $1,000,000\nI'm standing behind. So if only one of you eliminates yourself,\nyou'll become a millionaire. But if 50 of you eliminate yourselves,\nyou'll each get $20,000. So be honest, do you really think that you are\nthat one in 1000 player, the rightful champion winner\nof that $5,000,000? Or do you want to take the easy way out and walk away with money\nwhile you still can? Start the timer. [overlapping chatter] What will my family think?\nIf I say “no” to so much money? Take the deal. Take the deal. Yeah. I mean… It’s a lot of money… I will not leave this podium. I will not go home\nuntil that $5,000,000 is mine. -[chatter continues]\n-[boom] [MrBeast] Oh, we got one! [woman] Oh, my God! He did it! We got our first taker! Steve! As of right now, you're a millionaire. -But, oh! Someone else hit it!\n-[boom] Alright, now you’re only\na five-hundred thousandaire. -[beeps]\n-[booms continue] [man] That’s crazy though, bro, because\nimagine you're walking into a casino, you would never get that\nin a million years… [MrBeast] We are halfway through the time! Right now, if you press the button, -that's $250,000.\n-Heck, no. You're not gonna leave for $200,000? -No, I’m not--\n-$200,000? I’m not leaving. It’s just not worth it now.\nI mean, I-- I'm not taking the bribe. No chance.\nI'm here for the long haul till the end. -[yells]\n-Do you think I'm gonna take the deal? -No.\n-No way, Jimmy. No way. This dude's crazy. You're pressing it?\nYou're pressing it? Why not? It's getting a lot of people out\nright away, and that's less people\nwe have to compete against. -This is too intense, man!\n-We're staying! -Are you sure?\n-Yes! -[man] I don't know!\n-Think about it! There’s two minutes left! Oh, there goes another one! I ain't taking nothin’! [MrBeast] Bro, 90 grand’s a lot! That's cute compared\nto the $5,000,000 that's over here. Under one minute remains. [dramatic music continues] -Don't you dare.\n-[laughs] [laughing] Get out of here! [intensifying noises] -[clicks]\n-[booms] I should not have done that.\nI should not have done that. -Ten seconds!\n-You should press it now! -[MrBeast] Hey, y’all are crazy!\n-[yellling] Ah, come on, buddy!\nHit it! Hit the button! -No way!\n-[cheers] Are you serious? No way. [MrBeast] In the end,\nthe total amount of button presses was 52 people which means… Congratulations! You each\njust won a little under $20,000! -[cheering]\n-All 52 of you are now eliminated. I have a feeling\na lot of these contestants still in are gonna regret not taking that money, because this next game might be\nthe most cutthroat thing I've ever done. Should’ve took the money. Would this money change my life?\nAbsolutely. Do I want to see a pirate ship?\nDo I want to live in a city? So much more. ♪ I'm ready to go to the city\nI’m ready to go to the city ♪ ♪ I'm ready to go to the city ♪ I do not belong here.\nI don't know how I made it here. I have no strategy. [laughs] I'm done. [MrBeast]\nTo the 948 of you that rejected my offer, there is no turning back!\nThe Beast Games has now begun. [cheering] [dramatic music intensifies] And for the first game,\nyou will all be competing as teams. This row is a team.\nThis row is a team. This row is a team. You get the point. Each massive row\nof 80 players will be working together. -[cheers]\n-Yeah, but I wouldn't cheer quite yet, and that's because in order\nfor your team to move on, someone must sacrifice themselves. -Oh!\n-[MrBeast] Meaning that they will have to, at their own will,\nwalk away from $5,000,000, just so some of you\ncan continue competing in these games. Really thinking right now,\nI probably should have taken that $20K. So if you didn't take the money\nto go home, why would you\nsacrifice yourself for the team? I feel like I have to sacrifice myself. I just want people to know\nI really do care about them. And I wish more games\nwere like that. So… [overlapping chatter] I'm not going. I know you're not going.\nI know he's not going. -Who gon’ bite the bullets?\n-[man] I'm not touching it, please! Someone for the greater good\nof the whole team has to leave. -What's it look like down that way?\n-It won't be me. Nobody? Holy… [MrBeast]\nOh, yeah, and guys, one more thing. This game has already started, and it will not end until\nthe last three rows to eliminate someone will all be eliminated together. Only nine of the 12 rows\nwill be moving on. Come on! Click it! Click it! Click it! -[yells]\n-Come on! Oh! Whoa! That was quick. -Let's go! Safe! [laughs]\n-Congrats! Wait, come on. Please! Please! Please! -What's holding you back?\n-Somebody else might do it. Somebody! Over there, just somebody,\npush the button! [yells] What do we do? What do we do?\nCome on! -[cheering]\n-[man] Let's go! Don’t forget me! [cheers and yells continue] Yeah! Let’s go! -[shrieks]\n-Let's go! Let's go! Come on, guys, or we’re all gonna go!\nPress it! Press it! [buzzes] -Two!\n-I’m not going! -Darn it! Press it!\n-Please, press it! Please! Please! Please! Someone press it! Press the button!\nPress the button! [piano music playing] [yelling] -Please!\n-[man] Oh. One more, one more left. Press the button! Press the button!\nPress the f****** button! -[cheers and yells continue]\n-[music continues] [sounds fade out] -[yells and cheers]\n-I did it. [dramatic music intensifies] -[wails]\n-[man] Yeah! You're welcome. Win! Win! For your family… Please…\nWin for your family… I'll play for you, okay?\nI got this. Okay, I got it. I got it. Yeah! Yeah, baby!\nWe made it! We made it! Our whole row was just eliminated. My wife is still in there,\nand it only takes one person to win that $5,000,000, not two. Good luck, babe. All the kids and I\nwill be rooting for you at home. I'm trying not to cry. [laughs] -[man] Yeah! Yeah!\n-[cheering] -I love you!\n-I love you! In a very platonic way, I love you. -You took one for your team.\n-I did. All of these people deserve\na chance to win. Whoa. How are you feeling? Um, I’m sad. Everyone in your row, give her a round\nof applause for sacrificing herself. [applause and cheers] [clicks and beeps] [screaming] -[yells]\n-[woman] Oh, my God! -[yells]\n-Oh! Oh, my God! [yelling continues] [cries and yells] Now, a lot of you are probably wondering, is it even possible to drop 80 people\nat the same time? And the answer is yes. Drop the row. -[yells]\n-[mechanical clicks] [shocked crowd noises] [laughing] Whoa! That is crazy! Oh, my God. Oh… This row also couldn't find someone\nto sacrifice themselves. So… -[clicks]\n-Oh! There they go. [mechanical clicks] I think we mix it up for this final row. Hey, whoever's in the back,\njust start hitting random buttons. All right? [laughs] This is terrifying. [yelling] -Hey!\n-[man] No! No! No! No! -Okay. Well, all right.\n-Oh, my gosh. That was diabolical. Wait, there’s just one left. Any last words? I am not weak!\nThat's why I got number-- [yelling] All right, and with that,\nthe challenge is officially over. They should’ve got someone else. [cheers] I'm excited for another challenge,\nbut also nervous. So it's going to be tough. It's going to be stressful,\nbut it's going to be over soon. And we're going\nto make it to the city, baby. Let's go. [MrBeast]\nThe city she's talking about is no joke. This massive building you're seeing here\nis only the beginning. -Welcome to Beast City!\n-[cheers] [MrBeast]\nAt the end of this episode, contestants who progress\nwill move into their very own city. On top of that, later this season, they'll be fighting for their spot\non helicopters to a multimillion-dollar private island,\nwhich one of them will be winning. They'll also be firing cannons\non a real pirate ship. There's monster trucks. They'll run for their lives\nfrom real Navy Seals. And they will have to decide if\na train eliminates their closest friends. And of course,\nthey will have opportunities to win millions of dollars\non top of the grand prize. However, not all of them are confident. I guess the sad reality\nis not everybody can win. I think the odds are stacked against me.\nI've seen my competition. The reality of it is\nthat people are going to have to go, and I understand\nthat at any moment it can be me. The fact that it hasn't been me, really,\nhas a lot to do with luck. But that's the name of the game,\nand that's why we're here, to get down to one sole contestant\nwho's going to take home the $5,000,000. -I have a four-month-old son.\n-My dad, he's a military vet. I left my wife and my three-year-old son. But I want to fight for his future. Nothing I won’t do. No place I won’t go. I will do anything it takes\nto win that money. I've made amazing friends. Watching them get eliminated,\nit's brutal and short. Each round, we all get closer to winning. But moving on means saying goodbye\nto some really good people. -[dramatic music playing]\n-[lights click off] [clicking sound] [echoing] Are you guys ready\nfor the next challenge? [whispering] Alright, I'm gathering these games\nmight be a little stressful for you. So for this next game, let's introduce\nsomething a little more familiar. You'll notice, attached to each\nof your towers, are some colored boxes. Inside these boxes are blocks.\nYour goal is to stack all of your blocks on top of the red starting block\nwithin ten minutes. I don't care how you do it, as long as every block\nis stacked before the timer hits zero. At the end of the ten minute timer, if any of your blocks are not stacked\non top of that red block, or your tower falls over,\nyou'll be eliminated. I will only be eliminating\nthe first 100 towers that fall over. I'm shaking. I got to…\nYou shaking, bro? You are free to begin once\nthe timer starts. And… go! We're going\nuntil 100 of you are eliminated. The key here is to go slow. [MrBeast] So far in these games,\nthis exact room was deafeningly loud. -[yelling]\n-But somehow, even with over 700 players remaining, in this moment,\nit was nearly dead silent. [rumbling bass fades out] [clock ticking] [breathing heavily] Oh, my God. [crying]\nOh, my God. It's okay, it's okay. -[ticking continues]\n-[music intensifies] [blocks clanking] -[creaking]\n-[crashes] [gasps] -[crying] Oh, no!\n-[mechanical clicks] -[intense music playing]\n-[crying] I hate my life! -[ticking continues]\n-[music intensifies] No! [booms] Oh, no! Are you okay? Oh, no.\nYou still had more time. -Oh, my God.\n-[woman] Make as many squares as possible, so it's flat, flat, flat,\nso it's less height. How does mine look?\nDo you see any weaknesses? -Solid.\n-[man] Very solid. Top left. Yeah. You want to go over there\n'cause it's leaning a little bit. -To the left?\n-No, no, no. You want to go over here,\nyou want to counterweight it. Yeah. [music continues] Mine's done. But I can do… -[crumbling]\n-No, no, no. No! [buzzes] I decided to go as strong, as wide… Do you mind if I poke it? I would mind if you poked it.\nI do not want you to poke it. Okay. I won't poke it then. -[Nolan] They’re laser focused.\n-I know, I can finally hear you. -[laughs]\n-Oh! Oh! [buzzes] [crying] I'm gonna let you handle this one. -[booms]\n-Why do I gotta handle it? You got it, babe. Come on. Trust yourself. I don't even know.\nI don't even know if I still… [intense music playing] [crumbles] -Can you hand me that?\n-I can't, I'm sorry. I can't. I’m sorry. [booms] Oh. -[intense music continues]\n-[booms continue] [crumbles] -Oh.\n-[woman yells] [booming continues] Alright, I think this might\nbe the set up for me. No, brother! [rising chatter] It's tilting over this way. -No, no, hold it! Hold it! [yelling]\n-[crumbling continues] [man] Put it more towards the right side. -This side?\n-Center it out. Yeah. -This…\n-Right there. And hold it first. [music intensifies] [alarm blares] Attention, contestants! Do not move! I repeat, do not move! If less than 100 towers have fallen,\nwe will continue until 100 towers do fall. And so, while we're counting\nhow many towers have fallen, if I were you,\nI would stand very, very still. [dramatic music playing] [clock ticking] I'm really hoping\nthat there were 100 other towers that fell over before mine. I'm scared to move. [indistinct chatter] -I just…\n-[crumbles] [MrBeast]\nHere's a little behind the scenes. This is our control room\nwith all the guards. And they're not going to stop until\nthey've timestamped every tower fallen, using our world record holding\n1,107-camera system to find out which 100 towers fell first\nand who is going home. I think you're totally good.\nYou're definitely, like, good. [sniffles] Don't say that to me. [laughs] [digital noise intensifies] [dramatic music continues] [MrBeast] Alright, everybody,\ncan I have your attention? We needed 100 eliminations\nto move on from this challenge. And after reviewing footage\nfrom over a thousand cameras in this room, I have a verdict. Over 100 towers have fallen, which means if your tower is currently\nknocked over, you might still be in. There's so much tension.\nEven me, my legs are shaking. [MrBeast] On the count of three, I am going\nto reveal the eliminated players. -Are you ready to see who's eliminated?\n-[cheers] Three. Two. One. Go! -[clicks]\n-[yells] No! -[cheering]\n-[indistinct yells] -You're good! You're good! You're good!\n-[screams] [MrBeast] If your tower is white, you move\non to compete for this money. Let's go. [MrBeast] If it's red,\nwe’re gonna have to drop you. -[cheers]\n-[woman] That was awesome. [cheering and yelling continue] [cries] My heart was in my stomach. [MrBeast] There's a lot of people\nwho thought they were out who are still in. It looks like some people who are out,\nand didn’t realize they were. That's God. That’s God, I told y'all. We made it to the next round.\nLet's get after it. I'm just crying a little bit. I'm in. Noah's gone though, so that's harder. That's harder. But I'm in. Will you join me in saluting the people\nwho are about to be dropped? Everyone salute! [military trumpet playing] Guys, don't worry. The first few minutes of the fall are\nscary, but after that, it's totally fine. Drop 'em. -[military music intensifies]\n-[mechanical clicks] [yells] Whoever remains after this next challenge\nwill officially move into our city. [cheers] -Yeah!\n-Let’s get to the city, all right? [MrBeast]\nAll of you have made it very far. Let's get it, baby. [MrBeast]\nIt would be a shame to go out here. The only problem is the city has 500 beds,\nand there's over 600 of you. No. We need to get rid of over 100 people, so we're gonna play a little game. For this game,\nyou will again be competing in a team. But this time,\nit's the row to your left and right, which means they will vary in number. What do you think I'm going\nto be having you guys do? -[all] Bribes!\n-It's going to be a bribe. -A bribe.\n-[MrBeast] That is correct. This game is the final hurdle between\nyou and moving on in this competition. I will be offering bribes, -and whichever person accepts it,\n-[beeps] -will eliminate themselves and their rows.\n-[buzzes] The bribes will keep going up, and we will keep eliminating rows\nuntil we have 500 people. [dramatic music playing] All you have to do is take your hand,\npush that button, and you will instantly be brought\nbriefcases full of money. Almost immediately,\nthe room erupted in chaos, and people started to introduce\none another by their name. -My name’s Jonathan!\n-Alejandro! That's my name. [MrBeast] And not their number,\nbecause in this final game, the only way to move on\nis by working together. [music intensifies] [man] Come on! Yo! It’s this way. That's crazy. My name's Lori! We got this, we got this, we got this. I swear on everything.\nI will not take a bribe. 400! No, we're not doing it. Nothing, nothing, nothing, we are not. -Let's go. [laughs]\n-We got it. We got a good team right here.\nWe definitely going to the city, baby. We ain't doing this for nothing, baby.\nCome on, let's go. You can barely communicate\nwith 'em. How can you trust 'em? You can't.\nYou can say… you can't bro. -I haven't said anything to him.\n-Alright, I gotta know. It's kind of hard to. Is there a number? Yeah, but don't tell them. [Nolan] This could be one of the biggest\ndecisions of your life. He's like a devil on the shoulder, bro. [dramatic music continues] [MrBeast]\nAre you ready for the first bribe? -[cheers]\n-Guard, bring it on out. I've got a briefcase here\nwith $10,000 in it. [crowd booing] Ooh. Yeah, I think I'm gonna have\nto go for that one. I had a feeling not many of you\nwould go for that ten grand. But the good news is,\nwe have a lot of money. Bring out the next briefcase. -[shocked gasps]\n-Let's go! Now, I have $20,000 up here. No. [crowd boos] Hey-yo, Jordan! Just letting you know,\nyou scaring people, bro. Who, me? Yeah. I have no idea what they're saying,\nbut I'm chillin'. What dollar amount would it take\nto screw your row over? None.\nThat dollar amount right over there. -We're going until people leave, so…\n-Well, we ain't leaving. -[MrBeast] Hey, wait. What?\n-[man] Somebody took the 20K. [woman] Dude. Dang, bro, that's crazy.\nI felt so secure with the line. Yeah. We're done. Alright, what was the rationale? It's Beast Games,\nlike we're not here to make friends. 400! We're not doing it. Nothing. The fact is, I'm here for myself\nand my family, and I just– -Hey, gotta respect it.\n-I did it. I did it, bro. It's just not fair. I mean, it is, but it isn't.\nLike, I just didn't do anything. [MrBeast]\nThere was eight players in that row, which means there are now\n597 players remaining. AKA, 97 more people need to be eliminated. -[MrBeast] So who wants $20,000?\n-Nobody's going for it. [MrBeast] No? Well, all right.\nHow about $50,000 dollars? 50 grand is a lot of money. Who do you think is the weakest\nlink in your entire row? Between us, 674. When it was first announced\nthere was going to be this competition, we all looked at each other,\nwe were like, \"No way.\" And he was, I think, the one that was\njust kind of like, \"Okay, yeah, no.\" -Everyone trusts each other here, right?\n-Yeah! Alright. It's a $5,000,000 trust. He's thinking. I'm nervous about that. [musical sting] [Karl] Oh! Who did it? -[Tareq] Oh, my God, he pressed it.\n-[man] Jordan? -674, the guy that you were worried about?\n-The guy that I was worried about. Oh, boy. They're walking in front\nof the people you eliminated. Let's see if anyone else wants 50 grand. -Right here, dawg.\n-Dude! What the f***, Walter? I feel bad for those guys, but… [MrBeast] If you just don't turn around,\nthey don't exist. Yeah, that's kind of the mindset\nthat I’m going with. Don't take 50K. That's so stupid. I don't even want to look at him.\nI don't forgive him. [MrBeast] There's still 583 people here. Remember, we're going\nuntil we’re under 500 people. [buzzes] -Oh, somebody else pressed.\n-[MrBeast] What made you press it? I'm not gonna lie, I didn't trust my teammates. Really? You thought\nyour team was about to do it? I thought she was gonna to do it. Oh, my gosh. -Are you serious?\n-Alright, someone else hit it. -We got another 50 grand taker.\n-You just broke my heart, man. Like you said, it was either you or me. I trust my team. I think we got it.\nI think we're going to the city. We good. This ain't changing nothing.\nYeah. We good. Yeah, I'm not even gonna look at it. [MrBeast] Have you ever had an opportunity\nin your entire life to raise your finger, tap a button, and instantly give yourself $50,000 in cash? -[buzzes]\n-[groans] -[laughs]\n-No way, where? -[buzzes]\n-Oh, my gosh. -[MrBeast] Looks like someone hit it.\n-I’m sorry, babe. In this challenge,\nI've already given away 320 grand. but I still need to eliminate\n55 more players. Luckily, on this show,\nI have unlimited money to give away. Wow. This row is dedicated.\nTheir arms are in their shirts. I ain't going nowhere. Let's take it up a notch.\nMy new offer is 80,000 dollars. -[buzzes]\n-Oh! We're getting close to 500. -Anyone else want 80 grand?\n-I might have to go first. Oh! Another one! -This is getting crazy.\n-[buzzes] No! No! -[buzzes]\n-Take the money! It's the right thing to do for you. [MrBeast] You guys are crazy. -It's a ridiculous amount of money.\n-[buzzes] We got another press.\nWe got another press. -Did you press it?\n-Yeah. I took it. For my family,\nI gotta do that one. Dude! We all have families here, man. [MrBeast] There are 514 of you left.\n14 more eliminations to go. To get us over the hump,\nbring out two more briefcases. This will be my final offer,\n$100,000 dollars to anyone that self eliminates\nuntil we have 500 players remaining. [intense music playing] -[buzzes]\n-Oh! Somebody pressed it!\nSomebody pressed it! -Oh, my gosh!\n-Let’s go. [yells and cheers] -Alright. There's 508 of you.\n-My God! I still need eight more to go. $100,000 on the line. This could be the last button press. Oh, my God. -There’ll be bigger prizes later.\n-I won't even look at it. -Wow.\n-What is going on? Woo! Yeah! Yeah! Alright. 173 hit it.\nLet's see if there's eight people there. One. There's two. Three. Four. Five. Six. Seven. Oh. Um, small problem. There's only seven people in this row,\nwhich means the number is 501. -[groans]\n-No way. And I only have 500 beds in the city. Oh, we're so close. Yeah. Don't hit it. There's a Lamborghini,\na boat, in the city. You guys can have it.\nI just want the Tesla, okay. -We're going to the city!\n-City! -Take the money!\n-The city! -[MrBeast] So far in this game…\n-Hands in pockets, Gary. …people from all over the room\nwere boasting about trust. -We can trust each other, right?\n-Facts. City! City! City! City! -[claps]\n-[buzzes] [groans] [MrBeast] But sometimes, the people who you think\nyou can trust the most -are actually…\n-Oh, my God. …the people you can trust the least. -[cheers]\n-I took it. [piano music playing] It's 100! -Oh, my God. I’m so mad.\n-I'm sorry! -[MrBeast] And there we go.\n-I believed! [piano music continues] -[MrBeast] That is the end.\n-Yeah! [MrBeast] If your tower is white, you are\nofficially moving on to episode two. -[cheers]\n-We’re going to the city! Oh my God! -It's official. Let's go.\n-[MrBeast] Congratulations. We’re going to the city. -We’re going to the city!\n-We’re going, baby! Yeah! -And the final taker, $100,000.\n-Let's go, baby. And with that, we are now\nunder 500 contestants. It's okay. I forgive him. [MrBeast]\nWe've already given away over $2,000,000, breaking the world record\nfor the most amount of money given away in the first episode\nof a show ever. And this is just episode one. And at the end,\nsomeone is winning $5,000,000, the largest grand prize\nin any show in history. -You still got a chance!\n-Yeah! Yeah. [MrBeast]\nAnd to the 493 of you still competing, say your goodbyes to your fallen comrades. It's time for you\nto move into your brand new home. [emotional music playing] And to the rest of you,\nsay goodbye to $5,000,000. [electricity powers down] [clicking sounds] [intense music playing] [man] This is the most insane thing\nyou've ever seen in your lives. [MrBeast] 500 people is so many people. All right, guards, open the gate. Welcome to the city I built for you. Welcome to Beast City. I've spent over $15,000,000\nliterally building a city from scratch. And now, it's the city\nyou'll call home for the next month. They literally look like ants. Before I reveal the final twist\nof this episode, let me remind you\nwhat you have to look forward to. I just want to say,\nyou should all be proud of yourselves for making it this far. We started with a thousand contestants.\nYou have made it to the top 500! And we're just getting started. In coming episodes,\nyou will see the most insane, -psychological…\n-Catch it! -Get it. Get it. Get it.\n-[cries] [MrBeast] …emotional, and expensive\ngames in the history of entertainment, where people will compete\nfor their very own private island, if they can escape the Navy Seals\nhunting them down. [dramatic music playing] Go, go! [MrBeast]\nYou’ll watch players make the choice between a train eliminating their friends -and unfathomably large amounts of money…\n-$1,000,000! …and winning a brand new Lamborghini.\nAnd so, so much more. Good luck. Which one of these 493 players\nwill make entertainment history? As their lives will change,\nbut so will their bank accounts. And one of them\nwill become the champion winner of the largest real cash grand prize\nin the history of entertainment. Are you ready? [cheers] Throw up the 24 hour timer. When this timer hits zero, a game will begin\nwhere half of you will be eliminated. This show will take place\nover the next month. So if I were you,\nI'd get comfortable in this city. You're gonna need it. [clock ticking] Thanks for watching episode one \nof Beast Games!  I don't know how I convinced \nAmazon to do this but episodes two and three are free on\nthis channel as well. Enjoy the first three episodes here, and go watch the remaining seven episodes\nof Beast Games, only on Prime Video. ",
    "tokens": 6223
  }
]